import { ITicket } from "../types/Ticket";

export const tickets: ITicket[] = [
  {
    id: "1",
    title: "SomethingWentWrong",
    orderNumber: 4545,
    messages: [
      {
        msgId: "11",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-01",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
      {
        msgId: "12",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-05",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
      {
        msgId: "13",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-08",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
    ],
  },
  {
    id: "2",
    title: "SomethingWentWrong",
    orderNumber: 5000,
    messages: [
      {
        msgId: "21",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-01",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
      {
        msgId: "22",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-05",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
    ],
  },
  {
    id: "3",
    title: "SomethingWentWrong",
    orderNumber: 7000,
    messages: [
      {
        msgId: "31",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-01",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
      {
        msgId: "32",
        sender: "محمد صفر",
        receiver: "راشد فهد",
        cc: ["ahmed@example.com", "rashedf@example.com"],
        avatar: "./man2.png",
        date: "2025-01-05",
        time: "10:00",
        timeType: "PM",
        message:
          "وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات. وصف  مطول للتذكرة مثل نحتاج عرض سعر لخدمات الصيانة اللازمة للمعدات.",
      },
    ],
  },
];
